{
    "nodes": {
        "A6_100A": {
            "code": "6.100A",
            "label": "Introduction to Computer Science Programming in Python",
            "title": "Introduction to Computer Science Programming in Python",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Introduction to computer science and programming. Students develop skills to program and use computational techniques to solve problems. Topics include: the notion of computation, Python, simple algorithms and data structures, object-oriented programming, testing and debugging, and algorithmic complexity. Lectures are viewed outside of class; in-class time is dedicated to problem-solving and discussion. Combination of 6.100A and 6.100B (or 16.C20) counts as REST subject.",
            "why": "Required as part of the four fundamental subjects. Already ASEd.",
            "units": "2-0-4",
            "prereq_text": "None",
            "instructors": ["A. Bell"],
            "tags": ["Undergrad", "Fall", "Spring"]
        },
        "A8_01": {
            "code": "8.01",
            "label": "Physics I",
            "title": "Physics I",
            "area": "phys",
            "color": "var(--phys)",
            "description": "Introduces classical mechanics. Space and time: straight-line kinematics; motion in a plane; forces and static equilibrium; particle dynamics, with force and conservation of momentum; relative inertial frames and non-inertial force; work, potential energy and conservation of energy; kinetic theory and the ideal gas; rigid bodies and rotational dynamics; vibrational motion; conservation of angular momentum; central force motions; fluid mechanics. Subject taught using the TEAL (Technology-Enabled Active Learning) format which features students working in groups of three, discussing concepts, solving problems, and doing table-top experiments with the aid of computer data acquisition and analysis.",
            "why": "Prerequisite for other classes.",
            "units": "3-2-7",
            "prereq_text": "None",
            "instructors": ["K. Rajagopal"],
            "tags": ["Undergrad", "Fall", "Physics I"]
        },
        "A18_01": {
            "code": "18.01",
            "label": "Calculus",
            "title": "Calculus",
            "area": "math",
            "color": "var(--math)",
            "description": "Differentiation and integration of functions of one variable, with applications. Informal treatment of limits and continuity. Differentiation: definition, rules, application to graphing, rates, approximations, and extremum problems. Indefinite integration; separable first-order differential equations. Definite integral; fundamental theorem of calculus. Applications of integration to geometry and science. Elementary functions. Techniques of integration. Polar coordinates. L'Hopital's rule. Improper integrals. Infinite series: geometric, p-harmonic, simple comparison tests, power series for some elementary functions.",
            "why": "Prerequisite for other classes.",
            "units": "5-0-7",
            "prereq_text": "None",
            "instructors": ["S. Bai"],
            "tags": ["Undergrad", "Fall", "Spring", "Calculus I"]
        },
        "A6_1904": {
            "code": "6.1904",
            "label": "Introduction to Low-level Programming in C and Assembly",
            "title": "Introduction to Low-level Programming in C and Assembly",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Introduction to C and assembly language for students coming from a Python background (6.100A). Studies the C language, focusing on memory and associated topics including pointers, how different data structures are stored in memory, the stack, and the heap in order to build a strong understanding of the constraints involved in manipulating complex data structures in modern computational systems. Studies assembly language to facilitate a firm understanding of how high-level languages are translated to machine-level instructions.",
            "why": "Required as part of the four fundamental subjects. Could be 6.1903 instead.",
            "units": "2-2-2",
            "prereq_text": "6.100A",
            "instructors": ["J. D. Steinmeyer, S. Z. Hanono Wachman"],
            "tags": ["Undergrad", "Spring"]
        },
        "A6_3000": {
            "code": "6.3000",
            "label": "Signal Processing",
            "title": "Signal Processing",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Fundamentals of signal processing, focusing on the use of Fourier methods to analyze and process signals such as sounds and images. Topics include Fourier series, Fourier transforms, the Discrete Fourier Transform, sampling, convolution, deconvolution, filtering, noise reduction, and compression. Applications draw broadly from areas of contemporary interest with emphasis on both analysis and design.",
            "why": "Prerequisite for 6.9000.",
            "units": "4-0-8",
            "prereq_text": "6.100A",
            "instructors": ["D. Freeman"],
            "tags": ["Undergrad", "Fall", "Spring", "Rest Elec in Sci & Tech"]
        },
        "A6_1200": {
            "code": "6.1200",
            "label": "Mathematics for Computer Science",
            "title": "Mathematics for Computer Science",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Elementary discrete mathematics for science and engineering, with a focus on mathematical tools and proof techniques useful in computer science. Topics include logical notation, sets, relations, elementary graph theory, state machines and invariants, induction and proofs by contradiction, recurrences, asymptotic notation, elementary analysis of algorithms, elementary number theory and cryptography, permutations and combinations, counting tools, and discrete probability.",
            "why": "Required as part of the four fundamental subjects. Could be 6.120A instead but 6.1200 includes probability which fills prereqs for 6.1210.",
            "units": "5-0-7",
            "prereq_text": "Calculus I (GIR)",
            "instructors": ["Z. Abel"],
            "tags": [
                "Joint",
                "Undergrad",
                "Fall",
                "Spring",
                "Rest Elec in Sci & Tech"
            ]
        },
        "A8_02": {
            "code": "8.02",
            "label": "Physics II",
            "title": "Physics II",
            "area": "phys",
            "color": "var(--phys)",
            "description": "Introduction to electromagnetism and electrostatics: electric charge, Coulomb's law, electric structure of matter; conductors and dielectrics. Concepts of electrostatic field and potential, electrostatic energy. Electric currents, magnetic fields and Ampere's law. Magnetic materials. Time-varying fields and Faraday's law of induction. Basic electric circuits. Electromagnetic waves and Maxwell's equations. Subject taught using the TEAL (Technology Enabled Active Learning) studio format which utilizes small group interaction and current technology to help students develop intuition about, and conceptual models of, physical phenomena.",
            "why": "Prerequisite for other classes.",
            "units": "3-2-7",
            "prereq_text": "Calculus I (GIR) and Physics I (GIR)",
            "instructors": ["A. Shvonski"],
            "tags": ["Undergrad", "Fall", "Spring", "Physics II"]
        },
        "A18_02": {
            "code": "18.02",
            "label": "Calculus",
            "title": "Calculus",
            "area": "math",
            "color": "var(--math)",
            "description": "Calculus of several variables. Vector algebra in 3-space, determinants, matrices. Vector-valued functions of one variable, space motion. Scalar functions of several variables: partial differentiation, gradient, optimization techniques. Double integrals and line integrals in the plane; exact differentials and conservative fields; Green's theorem and applications, triple integrals, line and surface integrals in space, Divergence theorem, Stokes' theorem; applications.",
            "why": "Prerequisite for other classes.",
            "units": "5-0-7",
            "prereq_text": "Calculus I (GIR)",
            "instructors": ["J. Bush"],
            "tags": ["Undergrad", "Fall", "Spring", "Calculus II"]
        },
        "A6_1210": {
            "code": "6.1210",
            "label": "Introduction to Algorithms",
            "title": "Introduction to Algorithms",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Introduction to mathematical modeling of computational problems, as well as common algorithms, algorithmic paradigms, and data structures used to solve these problems. Emphasizes the relationship between algorithms and programming, and introduces basic performance measures and analysis techniques for these problems. Enrollment may be limited.",
            "why": "Required as part of the four fundamental subjects.",
            "units": "5-0-7",
            "prereq_text": "6.100A and ( 6.1200 or ( 6.120A and ( 6.3700 , 6.3800 , 18.05 , or 18.600 )))",
            "instructors": ["B. Chapman"],
            "tags": ["Undergrad", "Fall", "Spring"]
        },
        "A6_1910": {
            "code": "6.1910",
            "label": "Computation Structures",
            "title": "Computation Structures",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Provides an introduction to the design of digital systems and computer architecture. Emphasizes expressing all hardware designs in a high-level hardware description language and synthesizing the designs. Topics include combinational and sequential circuits, instruction set abstraction for programmable hardware, single-cycle and pipelined processor implementations, multi-level memory hierarchies, virtual memory, exceptions and I/O, and parallel systems.",
            "why": "Required as part of the four system design subjects.",
            "units": "4-0-8",
            "prereq_text": "Physics II (GIR) , 6.100A , and ( Coreq: 6.1903 or 6.1904 ); or permission of instructor",
            "instructors": ["Coreq: 6.1903", "S. Hanono Wachman"],
            "tags": ["Undergrad", "Fall", "Spring", "Rest Elec in Sci & Tech"]
        },
        "A6_2000": {
            "code": "6.2000",
            "label": "Electrical Circuits: Modeling and Design of Physical Systems",
            "title": "Electrical Circuits: Modeling and Design of Physical Systems",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Fundamentals of linear systems, and abstraction modeling of multi-physics lumped and distributed systems using lumped electrical circuits. Linear networks involving independent and dependent sources, resistors, capacitors, and inductors. Extensions to include operational amplifiers and transducers. Dynamics of first- and second-order networks; analysis and design in the time and frequency domains; signal and energy processing applications. Design exercises. Weekly laboratory with microcontroller and transducers.",
            "why": "Required as part of the four system design subjects.",
            "units": "3-2-7",
            "prereq_text": "Physics II (GIR)",
            "instructors": ["A. Hartz"],
            "tags": ["Undergrad", "Fall", "Spring", "Rest Elec in Sci & Tech"]
        },
        "A6_3800": {
            "code": "6.3800",
            "label": "Introduction to Inference",
            "title": "Introduction to Inference",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Introduces probabilistic modeling for problems of inference and machine learning from data, emphasizing analytical and computational aspects. Distributions, marginalization, conditioning, and structure, including graphical and neural network representations. Belief propagation, decision-making, classification, estimation, and prediction. Sampling methods and analysis. Introduces asymptotic analysis and information measures. Computational laboratory component explores the concepts introduced in class in the context of contemporary applications. Students design inference algorithms, investigate their behavior on real data, and discuss experimental results.",
            "why": "Required as part of the two math subjects. Could be 18.05 instead but that class is bad. Could also be 6.3700 but 6.3800 fulfills the lab requirement.",
            "units": "4-4-4",
            "prereq_text": "Calculus II (GIR) or permission of instructor",
            "instructors": ["P. Golland"],
            "tags": ["Undergrad", "Fall", "Institute Lab"]
        },
        "A18_06": {
            "code": "18.06",
            "label": "Linear Algebra",
            "title": "Linear Algebra",
            "area": "math",
            "color": "var(--math)",
            "description": "Basic subject on matrix theory and linear algebra, emphasizing topics useful in other disciplines, including systems of equations, vector spaces, determinants, eigenvalues, singular value decomposition, and positive definite matrices. Applications to least-squares approximations, stability of differential equations, networks, Fourier transforms, and Markov processes. Uses linear algebra software. Compared with 18.700, more emphasis on matrix algorithms and many applications.",
            "why": "Required as part of the two math subjects. Could also be 18.C06 instead",
            "units": "4-0-8",
            "prereq_text": "Calculus II (GIR)",
            "instructors": ["J. Urschel"],
            "tags": ["Undergrad", "Fall", "Spring", "Rest Elec in Sci & Tech"]
        },
        "A6_3100": {
            "code": "6.3100",
            "label": "Dynamical System Modeling and Control Design",
            "title": "Dynamical System Modeling and Control Design",
            "area": "ee",
            "color": "var(--ee)",
            "description": "A learn-by-design introduction to modeling and control of discrete- and continuous-time systems, from intuition-building analytical techniques to more computational and data-centric strategies. Topics include: linear difference/differential equations (natural frequencies, transfer functions); controller metrics (stability, tracking, disturbance rejection); analytical techniques (PID, root-loci, lead-lag, phase margin); computational strategies (state-space, eigen-placement, LQR); and data-centric approaches (state estimation, regression, and identification). Concepts are introduced with lectures and online problems, and then mastered during weekly labs. In lab, students model, design, test, and explain systems and controllers involving sensors, actuators, and a microcontroller (e.g., optimizing thrust-driven positioners or stabilizing magnetic levitators). Students taking graduate version complete additional problems and labs.",
            "why": "Required as part of the four system design subjects.",
            "units": "4-4-4",
            "prereq_text": "Physics II (GIR) and ( 18.06 or 18.C06 )",
            "instructors": ["J. White"],
            "tags": ["Undergrad", "Fall", "Spring", "Institute Lab"]
        },
        "A6_9000": {
            "code": "6.9000",
            "label": "Engineering for Impact",
            "title": "Engineering for Impact",
            "area": "ee",
            "color": "var(--ee)",
            "description": "Students work in teams to engineer hardware/software systems that solve important, challenging real-world problems. In pursuit of these projects, students engage at every step of the full-stack development process, from printed circuit board design to firmware to server to industrial design. Teams design and build functional prototypes of complete hardware/software systems. Grading is based on individual- and team-based elements. Satisfies 10 units of Institute Laboratory credit. Enrollment may be limited due to staffing and space requirements.",
            "why": "Required as part of the four system design subjects.",
            "units": "2-3-7",
            "prereq_text": "6.1910 , 6.2000 , and 6.3000",
            "instructors": null,
            "tags": ["Undergrad", "Spring", "Partial Lab"]
        },
        "A24_00": {
            "code": "24.00",
            "label": "Problems of Philosophy",
            "title": "Problems of Philosophy",
            "area": "other",
            "color": "var(--other)",
            "description": "Introduction to the problems of philosophy- in particular, to problems in ethics, metaphysics, theory of knowledge, and philosophy of logic, language, and science. A systematic rather than historical approach. Readings from classical and contemporary sources, but emphasis is on examination and evaluation of proposed solutions to the problems.",
            "why": "Required as part of the HASS Distribution requirement.",
            "units": "3-0-9",
            "prereq_text": "None",
            "instructors": ["A. Byrne"],
            "tags": [
                "Undergrad",
                "Fall",
                "HASS Humanities",
                "Communication Intensive HASS"
            ]
        },
        "Crew": {
            "code": "Crew",
            "label": "Men's Lightweight Crew",
            "title": "Men's Lightweight Crew",
            "area": "other",
            "color": "var(--other)",
            "description": "Best rowing team in the world.",
            "why": "Required as part of the PE requirement."
        },
        "A2_70": {
            "code": "2.70",
            "title": "FUNdaMENTALS of Precision Product Design",
            "label": "FUNdaMENTALS of Precision Product Design",
            "description": "Examines design, selection, and combination of machine elements to produce a robust precision system. Introduces process, philosophy and physics-based principles of design to improve/enable renewable power generation, energy efficiency, and manufacturing productivity. Topics include linkages, power transmission, screws and gears, actuators, structures, joints, bearings, error apportionment, and error budgeting. Considers each topic with respect to its physics of operation, mechanics (strength, deformation, thermal effects) and accuracy, repeatability, and resolution. Includes guest lectures from practicing industry and academic leaders. Students design, build, and test a small benchtop precision machine, such as a heliostat for positioning solar PV panels or a two or three axis machine. Prior to each lecture, students review the pre-recorded detailed topic materials and then converge on what parts of the topic they want covered in extra depth in lecture. Students are assessed on their preparation for and participation in class sessions. Students taking graduate version complete additional assignments. Enrollment limited.",
            "units": "3-3-6",
            "prereq_text": "2.008",
            "instructors": ["A. Slocum"],
            "tags": ["Undergrad", "Fall"]
        },
        "A18_01A": {
            "code": "18.01A",
            "title": "Calculus",
            "label": "Calculus",
            "area": "math",
            "color": "var(--math)",
            "description": "Six-week review of one-variable calculus, emphasizing material not on the high-school AB syllabus: integration techniques and applications, improper integrals, infinite series, applications to other topics, such as probability and statistics, as time permits. Prerequisites: one year of high-school calculus or the equivalent, with a score of 5 on the AB Calculus test (or the AB portion of the BC test, or an equivalent score on a standard international exam), or equivalent college transfer credit, or a passing grade on the first half of the 18.01 advanced standing exam.",
            "units": "5-0-7",
            "prereq_text": "Knowledge of differentiation and elementary integration",
            "instructors": ["J. Dunkel"],
            "tags": ["Undergrad", "Fall", "Calculus I"]
        },
        "A5_111": {
            "code": "5.111",
            "title": "Principles of Chemical Science",
            "label": "Principles of Chemical Science",
            "area": "chem",
            "color": "var(--chem)",
            "description": "Introduction to chemistry, with emphasis on basic principles of atomic and molecular electronic structure, thermodynamics, acid-base and redox equilibria, chemical kinetics, and catalysis. Introduction to the chemistry of biological, inorganic, and organic molecules.",
            "units": "5-0-7",
            "prereq_text": "None",
            "instructors": ["A. Willard, B. Pentelute", "B. McGuire, M. Hong"],
            "tags": ["Undergrad", "Fall", "Spring", "Chemistry"]
        },
        "A6_2220": {
            "code": "6.2220",
            "title": "Power Electronics Laboratory",
            "label": "Power Electronics Laboratory",
            "description": "Introduces the design and construction of power electronic circuits and motor drives. Laboratory exercises include the construction of drive circuitry for an electric go-cart, flash strobes, computer power supplies, three-phase inverters for AC motors, and resonant drives for lamp ballasts and induction heating. Basic electric machines introduced include DC, induction, and permanent magnet motors, with drive considerations. Provides instruction in written and oral communication. Students taking independent inquiry version 6.2221 expand the scope of their laboratory project. Enrollment limited.",
            "units": "3-6-3",
            "prereq_text": "6.2000 or 6.3100",
            "instructors": ["S. B. Leeb"],
            "tags": ["Undergrad", "Fall", "Institute Lab"],
            "area": "ee",
            "color": "var(--ee)"
        }
    }
}
